//// Написать программу, которая выводит на экран квадрат заданного числа

//// вариант 1. Решение для самых маленьких

//int number = 2;

//System.Console.WriteLine(number * number);

//// Вариант 2. Решение с базовыми элементами тестирования для тех кто постарше.

//int GetSquareOfValue(int number)
//{
//    return number * number;
//}

//if (4 == GetSquareOfValue(2))
//{
//    System.Console.WriteLine("Тест пройден");
//}
//else
//{
//    System.Console.WriteLine("Тест провален");
//}

//if (25 == GetSquareOfValue(-5))
//{
//    System.Console.WriteLine("Тест пройден");
//}
//else
//{
//    System.Console.WriteLine("Тест провален");
//}

//if (0 == GetSquareOfValue(0))
//{
//    System.Console.WriteLine("Тест пройден");
//}
//else
//{
//    System.Console.WriteLine("Тест провален");
//}

//if (9 != GetSquareOfValue(4))
//{
//    System.Console.WriteLine("Тест пройден");
//}
//else
//{
//    System.Console.WriteLine("Тест провален");
//}